RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_spi.c
            if (recv_buf && use_rx_dma && !RT_IS_ALIGN((rt_uint32_t)recv_buf, align_size))
            {
                aligned_recv_buf = rt_malloc_align(send_length, align_size);
                if (aligned_recv_buf == RT_NULL)
                {
                    state = HAL_ERROR;
                    LOG_E("malloc aligned_recv_buf failed!");
                    goto transfer_cleanup;
                }
                dma_recv_buf = aligned_recv_buf;
            }

#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
            // D-Cache maintenance for buffers that will be used by DMA
            if (dma_send_buf) rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)dma_send_buf, send_length);
            if (dma_recv_buf) rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, dma_recv_buf, send_length);
#endif
        }
#endif /* BSP_SPI_USING_DMA */

        /* Start data exchange in full-duplex DMA mode. */
        if (message->send_buf && message->recv_buf)
        {
#ifdef BSP_SPI_USING_DMA
            if (use_tx_dma && use_rx_dma)
            {
                state = HAL_SPI_TransmitReceive_DMA(spi_handle, (uint8_t *)dma_send_buf, dma_recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
            {
                state = HAL_SPI_TransmitReceive(spi_handle, (uint8_t *)send_buf, recv_buf, send_length, timeout_ms);
            }
        }
        else if (message->send_buf)
        {
#ifdef BSP_SPI_USING_DMA
            if (use_tx_dma)
            {
                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)dma_send_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
            {
                state = HAL_SPI_Transmit(spi_handle, (uint8_t *)send_buf, send_length, timeout_ms);
            }

            if (message->cs_release && (device->config.mode & RT_SPI_3WIRE))
            {
                /* release the CS by disable SPI when using 3 wires SPI */
                __HAL_SPI_DISABLE(spi_handle);
            }
        }
        else if(message->recv_buf)
        {
#ifdef BSP_SPI_USING_DMA
            rt_memset(dma_recv_buf, 0xFF, send_length);
            if (use_rx_dma)
            {
                state = HAL_SPI_Receive_DMA(spi_handle, dma_recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
            {
                /* clear the old error flag */
                __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
                state = HAL_SPI_Receive(spi_handle, recv_buf, send_length, timeout_ms);
            }
        }
        else
        {
            state = HAL_ERROR;
            LOG_E("message->send_buf and message->recv_buf are both NULL!");
        }

        if (state != HAL_OK)
        {
            LOG_E("SPI transfer error: %d", state);
            message->length = 0;
            spi_handle->State = HAL_SPI_STATE_READY;
            goto transfer_cleanup;
        }
        else
        {
            LOG_D("%s transfer done", spi_drv->config->bus_name);
        }

#ifdef BSP_SPI_USING_DMA
        if (use_tx_dma || use_rx_dma)
        {
            /* blocking the thread,and the other tasks can run */
            if (rt_completion_wait(&spi_drv->cpt, timeout_tick) != RT_EOK)
            {
                state = HAL_ERROR;
                LOG_E("wait for DMA interrupt overtime!");
                HAL_SPI_DMAStop(spi_handle);
                goto transfer_cleanup;
            }
        }
        else
        {
            rt_uint32_t timeout = timeout_ms;
            while (HAL_SPI_GetState(spi_handle) != HAL_SPI_STATE_READY)
            {
                if (timeout-- > 0)
                {
                    rt_thread_mdelay(1);
                }
                else
                {
                    LOG_E("timeout! SPI state did not become READY.");
                    state = HAL_TIMEOUT;
                    break;
                }
            }
        }

transfer_cleanup:
#ifdef BSP_SPI_USING_DMA
        /* Post-transfer processing */
        if (state == HAL_OK)
        {
            if (aligned_recv_buf != RT_NULL)
            {
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
                rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, aligned_recv_buf, send_length);
#endif
                rt_memcpy(recv_buf, aligned_recv_buf, send_length);
            }
        }

        // Free any temporary buffers that were allocated
        if (aligned_send_buf) rt_free_align(aligned_send_buf);
        if (aligned_recv_buf) rt_free_align(aligned_recv_buf);
#endif /* BSP_SPI_USING_DMA */
        if (state != HAL_OK)
        {
            break;
        }
    }

    if (message->cs_release && !(device->config.mode & RT_SPI_NO_CS) && (device->cs_pin != PIN_NONE))
    {
        if (device->config.mode & RT_SPI_CS_HIGH)
            rt_pin_write(device->cs_pin, PIN_LOW);
        else
            rt_pin_write(device->cs_pin, PIN_HIGH);
    }

    if(state != HAL_OK)
    {
        return -RT_ERROR;
    }
    return message->length;
}

static rt_err_t spi_configure(struct rt_spi_device *device,
                              struct rt_spi_configuration *configuration)
{
    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(configuration != RT_NULL);

    struct stm32_spi *spi_drv =  rt_container_of(device->bus, struct stm32_spi, spi_bus);
    spi_drv->cfg = configuration;

    return stm32_spi_init(spi_drv, configuration);
}

static const struct rt_spi_ops stm_spi_ops =
{
    .configure = spi_configure,
    .xfer = spixfer,
};

static int rt_hw_spi_bus_init(void)
{
    rt_err_t result;

    for (rt_size_t i = 0; i < sizeof(spi_config) / sizeof(spi_config[0]); i++)
    {
        spi_bus_obj[i].config = &spi_config[i];
        spi_bus_obj[i].spi_bus.parent.user_data = &spi_config[i];
        spi_bus_obj[i].handle.Instance = spi_config[i].Instance;

#ifdef BSP_SPI_USING_DMA
        /* initialize completion object */
        rt_completion_init(&spi_bus_obj[i].cpt);
#endif /* BSP_SPI_USING_DMA */

        result = rt_spi_bus_register(&spi_bus_obj[i].spi_bus, spi_config[i].bus_name, &stm_spi_ops);
        RT_ASSERT(result == RT_EOK);

        LOG_D("%s bus init done", spi_config[i].bus_name);
    }

    return result;
}

/**
  * Attach the spi device to SPI bus, this function must be used after initialization.
  */
rt_err_t rt_hw_spi_device_attach(const char *bus_name, const char *device_name, rt_base_t cs_pin)
{
    RT_ASSERT(bus_name != RT_NULL);
    RT_ASSERT(device_name != RT_NULL);

    rt_err_t result;
    struct rt_spi_device *spi_device;

    /* attach the device to spi bus*/
    spi_device = (struct rt_spi_device *)rt_malloc(sizeof(struct rt_spi_device));
    RT_ASSERT(spi_device != RT_NULL);

    result = rt_spi_bus_attach_device_cspin(spi_device, device_name, bus_name, cs_pin, RT_NULL);
    if (result != RT_EOK)
    {
        LOG_E("%s attach to %s faild, %d\n", device_name, bus_name, result);
    }

    RT_ASSERT(result == RT_EOK);

    LOG_D("%s attach to %s done", device_name, bus_name);

    return result;
}

/**
  * Detach the spi device from SPI bus.
  *
  * @param device_name the name of the spi device to be detached.
  */
rt_err_t rt_hw_spi_device_detach(const char *device_name)
{
    RT_ASSERT(device_name != RT_NULL);

    rt_err_t result;
    struct rt_spi_device *spi_device;

    rt_device_t device = rt_device_find(device_name);
    if (device == RT_NULL)
    {
        LOG_E("SPI device %s not found.", device_name);
        return -RT_ERROR;
    }

    if (device->type != RT_Device_Class_SPIDevice)
    {
        LOG_E("%s is not an SPI device.", device_name);
        return -RT_ERROR;
    }

    spi_device = (struct rt_spi_device *)device;

    result = rt_spi_bus_detach_device_cspin(spi_device);
    if (result != RT_EOK)
    {
        LOG_E("Failed to detach %s from its bus, error code: %d", device_name, result);
        return result;
    }

    rt_free(spi_device);

    LOG_D("SPI device %s has been detached.", device_name);

